zaremy/r2-z2/firmware/link_check/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# NimBLE central. No BLE stack has ever run on this board -- the factory image
# ships none (esp_wifi present, nimble/bluedroid absent), so arm 1 is itself
# the first proof that BLE works here at all.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# link_check has no Wi-Fi, so coex_check's core-pinning symbols are not copied
# across -- carrying a config the app never exercises is how a claim about the
# build stops matching the build.
#
# Note what that does NOT mean: CONFIG_ESP_COEX_SW_COEXIST_ENABLE is still =y in
# the generated sdkconfig, because IDF turns it on by default whenever BT is
# enabled. Not asking for a symbol is not the same as it being off, and the
# generated sdkconfig is the only thing that knows which. Checked, not assumed.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
